In [7]:
import pandas as pd
df1=pd.DataFrame({'Name':['geeta','kavi','kartik'],'Marks':[67,89,90]})
df2=pd.DataFrame({'Name':['kartik','kavi','geeta'],'Grade':['A','B','C']})
display(df1)
display(df2)
df1.merge(df2[['Name','Grade']])

     Name  Marks
0   geeta     67
1    kavi     89
2  kartik     90

     Name Grade
0  kartik     A
1    kavi     B
2   geeta     C

     Name  Marks Grade
0   geeta     67     C
1    kavi     89     B
2  kartik     90     A

In [5]:
df1

     Name  Marks
0   geeta     67
1    kavi     89
2  kartik     90